Revit 2026 API

# FabricationConfigurationReloadConfiguration Method

---

Reloads the fabrication configuration from its source fabrication configuration.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public ConfigurationReloadInfo ReloadConfiguration()
```
```vb
Public Function ReloadConfiguration As ConfigurationReloadInfo
```
```cpp
public:
ConfigurationReloadInfo^ ReloadConfiguration()
```
```fsharp
member ReloadConfiguration : unit -> ConfigurationReloadInfo
```

#### Return Value

ConfigurationReloadInfo The information about the reload of the fabrication configuration.

| Exception | Condition |
| --- | --- |
| InvalidOperationException | The fabrication configuration is not set yet. -or- The source fabrication configuration could not be found. -or- this operation failed. |

The configuration must be reloaded from its source fabrication configuration before loading new fabrication services or additional parts.

#### Reference

FabricationConfiguration Class

Autodesk.Revit.DB Namespace